docs/1c-export-2026-06-02/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентСкидкиНаценки</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчетаЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаЦены</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

docs/1c-export-2026-06-02/AccumulationRegisters/ПартииТоваровНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииТоваровНаСкладах</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КодОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КодыОперацийПартииТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписаниеПартий</Name>
					<Comment>Запись сформирована при списании партий</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКорСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументДвижения</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументДвиженияПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиСписанныхТоваров</Name>
					<Comment>Индекс строки списанных товаров</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОприходования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.КомплектацияНоменклатуры</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.Перепаковка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартийТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

docs/1c-export-2026-06-02/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УдалитьТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьШтрихкод</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьСерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьКачество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПредставлениеШтрихкода</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:DocumentRef.МаршрутныйЛист</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьКод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

docs/1c-export-2026-06-02/CommonModules/ВесовойУчет/Ext/Module.bsl
Функция СоздатьХарактеристикуПоВесу(Товар, Вес) Экспорт
	
	НоваяХарактеристика 				= Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
	НоваяХарактеристика.Владелец 		= Товар;
	НоваяХарактеристика.Наименование 	= Вес;
	НоваяХарактеристика.Вага 			= Вес;
	НоваяХарактеристика.Записать();
	Возврат НоваяХарактеристика.Ссылка;
	
КонецФункции

Функция НайтиИлиСоздатьХарактеристикуВес(Товар,Вес) Экспорт // устарело
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ХарактеристикиНоменклатуры.Ссылка
	               |ИЗ
	               |	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	               |ГДЕ
	               |	ХарактеристикиНоменклатуры.Владелец.Ссылка = &Ссылка
	               |	И ХарактеристикиНоменклатуры.Вага = &Вес";
	Запрос.УстановитьПараметр("Ссылка",Товар);
	Запрос.УстановитьПараметр("Вес", Вес);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;		
	Иначе		
		НоваяХарактеристика 				= Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
		НоваяХарактеристика.Владелец 		= Товар;
		НоваяХарактеристика.Наименование 	= Вес;
		НоваяХарактеристика.Вага 			= Вес;
		НоваяХарактеристика.Записать();
		Возврат НоваяХарактеристика.Ссылка;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьЦенуЗаВес(Период, Номенклатура, Продажа = Ложь, ВраховуватиАкційнуЦіну = Истина) Экспорт 
	
	Результат = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Цена
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&Период,
	|			Номенклатура = &Номенклатура
	|				И ТипЦен = &ТипЦен) КАК ЦеныНоменклатурыСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	ТипЦен = ?(Продажа, Справочники.ТипыЦенНоменклатуры.ЦенаПродажиВес, Справочники.ТипыЦенНоменклатуры.ЦенаЗакупкиВес);
	Если Продажа И НЕ ВраховуватиАкційнуЦіну Тогда 
		ТипЦен = Справочники.ТипыЦенНоменклатуры.ПродажБезАкций;
	КонецЕсли;
	
	
	Запрос.УстановитьПараметр("ТипЦен", ?(Продажа, Справочники.ТипыЦенНоменклатуры.ЦенаПродажиВес, Справочники.ТипыЦенНоменклатуры.ЦенаЗакупкиВес));
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат = Выборка.Цена;
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьЦенуЗаВесИзПрихода(Номенклатура, ХарактеристикаНоменклатуры) Экспорт 
	з = Новый Запрос;
	з.Текст = "ВЫБРАТЬ
	          |	ПартииТоваровНаСкладах.Стоимость / ПартииТоваровНаСкладах.Количество / ПартииТоваровНаСкладах.ХарактеристикаНоменклатуры.Вага КАК Собівартість
	          |ИЗ
	          |	РегистрНакопления.ПартииТоваровНаСкладах КАК ПартииТоваровНаСкладах
	          |ГДЕ
	          |	ПартииТоваровНаСкладах.ВидДвижения = &ВидДвижения
	          |	И ПартииТоваровНаСкладах.Номенклатура = &Номенклатура
	          |	И ПартииТоваровНаСкладах.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры";
	з.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Приход);
	з.УстановитьПараметр("Номенклатура", Номенклатура);
	з.УстановитьПараметр("ХарактеристикаНоменклатуры", ХарактеристикаНоменклатуры);
	Выборка = з.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Собівартість;
	КонецЕсли;
	Возврат 0;	
	
КонецФункции


Функция ОтриматиДатуНадходження(ХарактеристикаНоменклатуры) Экспорт
	з = Новый  Запрос;
	з.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	          |	ПартииТоваровНаСкладахОстатки.ДокументОприходования.Дата КАК ДокументОприходованияДата
	          |ИЗ
	          |	РегистрНакопления.ПартииТоваровНаСкладах.Остатки(, ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры) КАК ПартииТоваровНаСкладахОстатки
	          |
	          |УПОРЯДОЧИТЬ ПО
	          |	ДокументОприходованияДата";
	з.УстановитьПараметр("ХарактеристикаНоменклатуры", ХарактеристикаНоменклатуры);
	Выборка = з.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Если ТипЗнч(Выборка.ДокументОприходованияДата) = Тип("Дата") Тогда  
			Возврат Выборка.ДокументОприходованияДата;
		Иначе
			Возврат ТекущаяДата();
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТекущаяДата();
КонецФункции


Функция ВесДляШтрихкода(Характеристика) Экспорт 
	
	Результат 	= "000";
	
	Разрядность = 1;	
	Реквизит 	= Метаданные.Справочники.ХарактеристикиНоменклатуры.Реквизиты.Найти("Вага");
	Если Реквизит <> Неопределено Тогда 
		Разрядность = Реквизит.Тип.КвалификаторыЧисла.РазрядностьДробнойЧасти;
	КонецЕсли;	
	Результат 	= Формат((Характеристика.Вага * Pow(10, Разрядность)), "ЧЦ=3; ЧВН=; ЧГ=");	
	
	Возврат Результат;
	
КонецФункции	

Функция ВесИзШтрихкода(Штрихкод) Экспорт 
	
	Результат = Неопределено;
	
	ПрефиксШтучногоТовара 		= СокрЛП(Константы.ПрефиксШтучногоТовара.Получить());
	ПрефиксШтучногоТовара 		= ?(ПустаяСтрока(ПрефиксШтучногоТовара), "0", ПрефиксШтучногоТовара);
	ПрефиксВнутреннегоШтрихкода = Константы.ПрефиксВнутреннегоШтрихкода.Получить();	
	ПрефиксВнутреннегоШтрихкода = Формат(ПрефиксВнутреннегоШтрихкода, "ЧЦ=2; ЧН=; ЧВН=");	
	Префиксы 					= "2" + ПрефиксШтучногоТовара + ПрефиксВнутреннегоШтрихкода;
	Если Сред(Штрихкод, 1, СтрДлина(Префиксы)) = Префиксы Тогда 
		Разрядность 				= 3;	
		РазрядностьДробнойЧасти 	= 1;
		Реквизит 					= Метаданные.Справочники.ХарактеристикиНоменклатуры.Реквизиты.Найти("Вага");
		Если Реквизит <> Неопределено Тогда 
			Разрядность 			= Реквизит.Тип.КвалификаторыЧисла.Разрядность;
			РазрядностьДробнойЧасти = Реквизит.Тип.КвалификаторыЧисла.РазрядностьДробнойЧасти;
		КонецЕсли;	
		ВесВШтрихкоде				= Число(Сред(Штрихкод, СтрДлина(Префиксы) + 1, Разрядность));
		Результат 					= ВесВШтрихкоде / Pow(10, РазрядностьДробнойЧасти);	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции	

#Если Клиент Тогда
Процедура НовыйШтрихкодПриПоступлении(ТекущаяСтрока) Экспорт 
	
	Если ТекущаяСтрока = Неопределено Тогда
		Ответ = Вопрос("Не выбрана строка с товаром, для которой регистрируется штрихкод.", РежимДиалогаВопрос.ОК);
		Возврат;
	Иначе 	
		Ответ = Вопрос("Сформировать новый штрихкод для выбранной позиции?", РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		Иначе
			ВладелецШК 			= ТекущаяСтрока.Номенклатура;
			ХарактеристикаШК	= ТекущаяСтрока.ХарактеристикаНоменклатуры;
			ЕдиницаИзмеренияШК 	= ТекущаяСтрока.Номенклатура.ЕдиницаХраненияОстатков;
			ТипШтрихкодаШК		= ПланыВидовХарактеристик.ТипыШтрихкодов.EAN13;
			КачествоШК         	= Справочники.Качество.Новый;
			
			ЗапросШК = Новый Запрос;
			ЗапросШК.Текст = 
			"ВЫБРАТЬ
			|	Штрихкоды.Штрихкод
			|ИЗ
			|	РегистрСведений.Штрихкоды КАК Штрихкоды
			|ГДЕ
			|	Штрихкоды.Владелец = &Владелец
			|	И Штрихкоды.ТипШтрихкода = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ТипыШтрихкодов.EAN13)
			|	И Штрихкоды.ЕдиницаИзмерения = &ЕдиницаИзмерения
			|	И Штрихкоды.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
			|	И Штрихкоды.Качество = ЗНАЧЕНИЕ(Справочник.Качество.Новый)";			
			ЗапросШК.УстановитьПараметр("Владелец", ВладелецШК);
			ЗапросШК.УстановитьПараметр("ЕдиницаИзмерения", ЕдиницаИзмеренияШК);
			ЗапросШК.УстановитьПараметр("ХарактеристикаНоменклатуры", ХарактеристикаШК);
			РезультатШК = ЗапросШК.Выполнить();
			Если РезультатШК.Пустой() Тогда 
				ЗаписьШК 							= РегистрыСведений.Штрихкоды.СоздатьМенеджерЗаписи();
				ЗаписьШК.Владелец         			= ВладелецШК;
				ЗаписьШК.ХарактеристикаНоменклатуры = ХарактеристикаШК;
				ЗаписьШК.ЕдиницаИзмерения 			= ЕдиницаИзмеренияШК;
				ЗаписьШК.ТипШтрихкода     			= ТипШтрихкодаШК;
				ЗаписьШК.Качество         			= КачествоШК;
				ЗаписьШК.Штрихкод         			= РаботаСТорговымОборудованием.СформироватьШтрихКод(, , ХарактеристикаШК);
				Попытка
					ЗаписьШК.Записать();
				Исключение
					Вопрос("Не удалось сформировать штрихкод!", РежимДиалогаВопрос.ОК);	
				КонецПопытки;				
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры	

Процедура НовыйШтрихКодДокумента(Документ) Экспорт 
	
	Ответ = Вопрос("Сформировать штрихкод для данного документа?", РежимДиалогаВопрос.ДаНет);
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	Иначе
		ВладелецШК 			= Документ;
		ТипШтрихкодаШК		= ПланыВидовХарактеристик.ТипыШтрихкодов.EAN13;
		
		ЗапросШК = Новый Запрос;
		ЗапросШК.Текст = 
		"ВЫБРАТЬ
		|	Штрихкоды.Штрихкод
		|ИЗ
		|	РегистрСведений.Штрихкоды КАК Штрихкоды
		|ГДЕ
		|	Штрихкоды.Владелец = &Владелец
		|	И Штрихкоды.ТипШтрихкода = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ТипыШтрихкодов.EAN13)";			
		ЗапросШК.УстановитьПараметр("Владелец", ВладелецШК);
		РезультатШК = ЗапросШК.Выполнить();
		Если РезультатШК.Пустой() Тогда 
			ЗаписьШК 							= РегистрыСведений.Штрихкоды.СоздатьМенеджерЗаписи();
			ЗаписьШК.Владелец         			= ВладелецШК;
			ЗаписьШК.ТипШтрихкода     			= ТипШтрихкодаШК;
			ЗаписьШК.Штрихкод         			= РаботаСТорговымОборудованием.СформироватьШтрихКодДокумента();
			Попытка
				ЗаписьШК.Записать();
			Исключение
				Вопрос("Не удалось сформировать штрихкод!", РежимДиалогаВопрос.ОК);	
			КонецПопытки;
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры	
#КонецЕсли

Процедура Пауза(Секунд) Экспорт
	
	КонецПаузы = ТекущаяДата() + Секунд;
	Пока ТекущаяДата() < КонецПаузы Цикл
	КонецЦикла;
	
КонецПроцедуры	

Функция ПолучитьШтрихкодПоХарактеристике(Характеристика) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Штрихкоды.Штрихкод
	               |ИЗ
	               |	РегистрСведений.Штрихкоды КАК Штрихкоды
	               |ГДЕ
	               |	Штрихкоды.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
	               |	И Штрихкоды.Владелец ССЫЛКА Справочник.Номенклатура";
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", Характеристика);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Штрихкод;
	Иначе 
		Возврат "";
	КонецЕсли;
	
КонецФункции

// Процедура обрабатывает нажатия кнопок "Взвесить товар" и "Уствновить вес"
// табличного поля "Товары".
//
Процедура ВзвешиваниеТовара(ТекущаяСтрока = Неопределено, УстановитьВес = Ложь) Экспорт
	
	Если ТекущаяСтрока = Неопределено Тогда 
		Возврат;	
	КонецЕсли;	
	
	ФормаВес 				= ПолучитьОбщуюФорму("ФормаВес");
	ФормаВес.УстановитьВес 	= УстановитьВес;
	ФормаВес.Номенклатура 	= ТекущаяСтрока.Номенклатура;
	ВесТовара 				= ФормаВес.ОткрытьМодально();
	Если ВесТовара = Неопределено Тогда 
		ВесТовара = 0
	КонецЕсли;	
	Если ВесТовара <> 0 И ФормаВес.Характеристика <> Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка() Тогда 
		ТекущаяСтрока.ХарактеристикаНоменклатуры = ФормаВес.Характеристика;
	КонецЕсли;			
	
КонецПроцедуры
